In [14]:
import pandas as pd
pd
print(pd.__version__)

1.3.4

In [15]:
data = {'col1': ['1','2','3','teks'],
       'col2': ['1','2','3','4']}
        
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [16]:
#karena data diatas berupa string maka akan dikenali sebagai objek
df.dtypes

col1    object
col2    object
dtype: object

In [17]:
#konversi tipe data dengan fungsi astype()
#jika ingingin merubah ke tipedata float maka lansung saja ganti int ke float
df_x = df.astype({'col2':int})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [18]:
#kolom 2 secara tidak langsung akan menjadi data integer
df_x.dtypes

col1    object
col2     int32
dtype: object

In [19]:
#konversi tipe data keseluruhan pada data frame dengan menggunakan fungsi to_numeric()
#jika dalam data terdapat bilangan teks yg tidak dapat dikonversi maka fungsi errors='coerce' akan merubah menjadi nan
# atau (missing value)
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [20]:
df.dtypes

col1    object
col2    object
dtype: object